{"data":{"jobs":{"edges":[{"node":{"frontmatter":{"title":"Machine Learning Engineer/ Researcher","company":"Data Science Nigeria (DSN)","location":"Nigeria","range":"Feb 2020 - Oct 2020","url":"https://www.datasciencenigeria.org/"},"html":"<ul>\n<li>Participated in the goal of raising 1 million AI talent in Nigeria in the next 10 years by teaching different classes comprising of (undergraduate, graduate and working class) in machine learning</li>\n<li>Research and Build a brand sentiment analysis for banks tackling code switiching (mixing of pidgin with english) in customers text . (A team of 2)</li>\n<li>Spear head the research in building fast customer response bot for financial instuite using Natural language processing to tackle lags in customer's response and also managing attention.</li>\n<li>This research was also presented as a poster in 2020 Neurips. Also the bot was deployed on aws and the tools use are Pytorch, boto3, twitter api, fastai.</li>\n<li>Did research on how to eliminate hunger in Nigeria and we propose the use of NewsVendor model to prevent food wastage. the paper was submitted as a poster in Global EC20 Conference.</li>\n<li>Spear-head the development of cv ranker (document retrival ) to assist HR in filtering out cvs.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Software engineer","company":"Datopian","location":"United States","range":"Nov 2020 - Present","url":"https://github.com/datopian"},"html":"<ul>\n<li>Building Next-GEN Data management/driven tools and platform using React, graphql, nextjs, Apollo client e.t.c</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Data Scientist (Intern)","company":"iQube Labs","location":"Nigeria","range":"Apr 2019 - Oct 2019","url":"https://www.linkedin.com/company/iqube-labs/"},"html":"<ul>\n<li>Built a fullstack data driven system called twitter web analytics. Analyze users twitter account with full data analysis supplemented with visualisation in realtime. Also support tweet sentiment anlysis, source of media of all replies, friendship network e.t.c built with python, flask, pandas , javascript, jquery, Dimple.js, textblob and tweepy.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Machine Learning Engineer / Python Developer","company":"DemzAnalytics","location":"London","range":"Oct 2019 - Feb 2020","url":"https://www.linkedin.com/company/demz-inc/"},"html":"<ul>\n<li>Its contract base</li>\n<li>Work with a diverse team of 5 to build social platform security using computer vision in collaboration with <a href=\"https://www.linkedin.com/company/social-media-charter/\">DeepView</a></li>\n<li>Created a pipeline that automate data generation for training model e.g fetching images, video and text from twitter using twitter bot in python (deployed on aws) and save them directly to google bucket</li>\n<li>Work with a team of python developer in creating an intelligent editor for financial document</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Java Developer (Intern)","company":"Longbridge Technologies","location":"Nigeria","range":"Jun 2018 - Dec 2018","url":"https://www.linkedin.com/company/iqube-labs/"},"html":"<ul>\n<li>Created a platform model and database structure using hibernate</li>\n<li>Built a school management enterprise product using spring framework</li>\n<li>Redesign Mantis (a product mangement software) using PHP, to suite the company taste.</li>\n</ul>"}}]}}}